ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template_v2/Drivers/BSP/Src/stm32f4_i2c_mpu9250.c
/******************************************************************//**
* @file		stm32f4_i2c_mpu9250.c
* @brief	Contains all functions support for I2C based MPU9250
*           9DOF Sensor library
* @version	1.0
* @date		23. Jan. 2017
* @author	Bhavin.Edutech Learning Solutions
**********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup MPU9250
 * @{
 */

/* Includes ------------------------------------------------------------------- */
#include "stm32f4_i2c_mpu9250.h"


/** @defgroup STM32F4_I2C_MPU9250_Exported_Handle
 * @{
 */
I2C_HandleTypeDef hi2c1_mpu9250;

/**
  * @}
  */

/** @defgroup STM32F4_I2C_MPU9250_Private_variables
  * @{
  */
float SelfTest[6];
float gyroBias[3],accelBias[3]; // Bias corrections for gyro and accelerometer
float magCalibration[3], magbias[3];  // Factory mag calibration and mag bias

uint8_t Ascale=0;               // AFS_2G, AFS_4G, AFS_8G, AFS_16G
uint8_t Gscale=0;               // GFS_250DPS, GFS_500DPS, GFS_1000DPS, GFS_2000DPS
uint8_t Mscale=0;               // MFS_14BITS or MFS_16BITS, 14-bit or 16-bit magnetometer resolution
uint8_t Mmode=0;                // Either 8 Hz 0x02) or 100 Hz (0x06) magnetometer data ODR
float aRes, gRes, mRes;       // scale resolutions per LSB for the sensors

int16_t accelCount[3];  // Stores the 16-bit signed accelerometer sensor output
int16_t gyroCount[3];   // Stores the 16-bit signed gyro sensor output
int16_t magCount[3];    // Stores the 16-bit signed magnetometer sensor output
float q[4];           // vector to hold quaternion

float ax, ay, az, gx, gy, gz, mx, my, mz; // variables to hold latest sensor data values
float pitch, yaw, roll;
float deltat=0;                             // integration interval for both filter schemes
int lastUpdate, firstUpdate, Now;    // used to calculate integration interval
int delt_t; // used to control display output rate
int count;  // used to control display output rate
int16_t tempCount;   // Stores the real internal chip temperature in degrees Celsius

/**
  * @}
  */


/** @defgroup STM32F4_I2C_MPU9250_Private_Functions
  * @{
  */

/**
 * @brief This function is support function for BSP_MPU9250_I2C1_Init
 *        This function configures GPIO of I2C1
 * @param hi2c  Provide I2C handle
 *      @arg  &hi2c1_mpu9250
 * @retval None
 */
static void MPU9250_I2C1_MspInit(I2C_HandleTypeDef* hi2c)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  if(hi2c->Instance==I2C1)
  {
    /**I2C1 GPIO Configuration
    PB8     ------> I2C1_SCL
    PB9     ------> I2C1_SDA
    */
    GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* Peripheral clock enable */
    __I2C1_CLK_ENABLE();

    /* Peripheral interrupt init*/
//    HAL_NVIC_SetPriority(I2C1_ER_IRQn, 5, 0);
//    HAL_NVIC_EnableIRQ(I2C1_ER_IRQn);
//    HAL_NVIC_SetPriority(I2C1_EV_IRQn, 5, 0);
//    HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);
  }
}


/**
 * @brief To transmit data on I2C
 * @param i2c_Addr device address
 * @param Wr_Addr Register address on which Wr_Data will be written
 * @param Wr_Data data
 * @return  value   if data written successful, it will return 0 otherwise 1
 */
static uint8_t I2C_WriteRegister(uint8_t i2c_addr,uint8_t Wr_Addr, uint8_t Wr_Data)
{
  uint8_t I2C_Tx_Buf[2]={0};

  I2C_Tx_Buf[0] = Wr_Addr;
  I2C_Tx_Buf[1] = Wr_Data;

  /* write byte to addr  */
  if(HAL_I2C_Master_Transmit(&hi2c1_mpu9250,i2c_addr,I2C_Tx_Buf,2,2000) == HAL_OK)
  {
    return (0);
  }
  else
  {
    return (1);
  }
}

/**
 * @brief To read data from the I2C based device
 * @param i2c_Addr device address
 * @param Rd_Addr Register address from data to be read
 * @return value  If data read successful, it will return data otherwise 1
 */
static uint8_t I2C_ReadRegister(uint8_t i2c_addr,uint8_t Rd_Addr)
{
  uint8_t I2C_Tx_Buf[2]={0};
  uint8_t I2C_Rx_Buf[2]={0};

  I2C_Tx_Buf[0] = Rd_Addr;

  /* write byte to addr  */
  if(HAL_I2C_Master_Transmit(&hi2c1_mpu9250,i2c_addr,I2C_Tx_Buf,1,2000) != HAL_OK)
  {
    return 1;
  }

  if (HAL_I2C_Master_Receive(&hi2c1_mpu9250,i2c_addr,I2C_Rx_Buf,1,2000) == HAL_OK)
  {
    return (I2C_Rx_Buf[0]);
  }
  else
  {
    return (1);
  }
}

/**
 * @brief To read data from the I2C based device
 * @param i2c_Addr device address
 * @param Rd_Addr Register address from data to be read
 * @return value  If data read successful, it will return data otherwise 1
 */
static uint8_t I2C_ReadBytes(uint8_t i2c_addr,uint8_t Rd_Addr,uint8_t* data_buf, uint16_t length)
{
  uint8_t I2C_Tx_Buf[2]={0};

  I2C_Tx_Buf[0] = Rd_Addr;

  /* write byte to addr  */
  if(HAL_I2C_Master_Transmit(&hi2c1_mpu9250,i2c_addr,I2C_Tx_Buf,1,2000) != HAL_OK)
  {
    return 1;
  }

  if (HAL_I2C_Master_Receive(&hi2c1_mpu9250,i2c_addr,data_buf,length,2000) == HAL_OK)
  {
    return (0);
  }
  else
  {
    return (1);
  }
}
/**
  * @}
  */


/** @defgroup STM32F4_I2C_MPU9250_Functions
  * @{
  */

/**
 * @brief This Function configures and Initializes I2C1
 * @retval None
 */
void BSP_MPU9250_I2C1_Init(void)
{
  __GPIOB_CLK_ENABLE();

  hi2c1_mpu9250.Instance = I2C1;
  hi2c1_mpu9250.Init.ClockSpeed = 100000;
  hi2c1_mpu9250.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1_mpu9250.Init.OwnAddress1 = 0;
  hi2c1_mpu9250.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1_mpu9250.Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
  hi2c1_mpu9250.Init.OwnAddress2 = 0;
  hi2c1_mpu9250.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
  hi2c1_mpu9250.Init.NoStretchMode = I2C_NOSTRETCH_DISABLED;

  MPU9250_I2C1_MspInit(&hi2c1_mpu9250);
  HAL_I2C_Init(&hi2c1_mpu9250);
}

/**
 * @brief This function is for De-Initializing I2C1
 * @param hi2c Provide I2C handle
 *      @arg  &hi2c1_mpu9250
 * @retval None
 */
void BSP_MPU9250_I2C1_MspDeInit(I2C_HandleTypeDef* hi2c)
{
  if(hi2c->Instance==I2C1)
  {
    /* Peripheral clock disable */
    __I2C1_CLK_DISABLE();

    /**I2C1 GPIO Configuration
    PB8     ------> I2C1_SCL
    PB9     ------> I2C1_SDA
    */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_8|GPIO_PIN_9);

    /* Peripheral interrupt Deinit*/
//    HAL_NVIC_DisableIRQ(I2C1_ER_IRQn);
//    HAL_NVIC_DisableIRQ(I2C1_EV_IRQn);
  }
}

/**
 * @brief Device connection test
 * @return device register id
 */
uint8_t MPU9250_ConnentTest(void)
{
  uint8_t whoami;
  whoami = I2C_ReadRegister(MPU9250_I2C_ADDRESS, WHO_AM_I_MPU9250);  // Read WHO_AM_I register for MPU-9250
  if(whoami == 1)
  {
    uprintf(&huart4,"Error! unable to connect MPU9250\r\n");
    while(1);
  }
  else
  {
    return whoami;
  }
}


/**
 * @brief Read INT pin status
 * @return value
 */
uint8_t MPU9250_INT_PinStatus(void)
{
  return I2C_ReadRegister(MPU9250_I2C_ADDRESS,INT_STATUS);
}

/**
 * @brief magnetometer scales (and their register bit settings)
 */
void MPU9250_GetMres(void)
{
  switch (Mscale)
  {
    // Possible magnetometer scales (and their register bit settings) are:
    // 14 bit resolution (0) and 16 bit resolution (1)
    case MFS_14BITS:
          mRes = 10.0*4219.0/8190.0; // Proper scale to return milliGauss
          break;
    case MFS_16BITS:
          mRes = 10.0*4219.0/32760.0; // Proper scale to return milliGauss
          break;
  }
}


/**
 *@brief gyro scales (and their register bit settings)
 */
void MPU9250_GetGres(void)
{
  switch (Gscale)
  {
    // Possible gyro scales (and their register bit settings) are:
    // 250 DPS (00), 500 DPS (01), 1000 DPS (10), and 2000 DPS  (11).
        // Here's a bit of an algorith to calculate DPS/(ADC tick) based on that 2-bit value:
    case GFS_250DPS:
          gRes = 250.0/32768.0;
          break;
    case GFS_500DPS:
          gRes = 500.0/32768.0;
          break;
    case GFS_1000DPS:
          gRes = 1000.0/32768.0;
          break;
    case GFS_2000DPS:
          gRes = 2000.0/32768.0;
          break;
  }
}

/**
 * @brief accelerometer scales (and their register bit settings)
 */
void MPU9250_GetAres(void)
{
  switch (Ascale)
  {
    // Possible accelerometer scales (and their register bit settings) are:
    // 2 Gs (00), 4 Gs (01), 8 Gs (10), and 16 Gs  (11).
        // Here's a bit of an algorith to calculate DPS/(ADC tick) based on that 2-bit value:
    case AFS_2G:
          aRes = 2.0/32768.0;
          break;
    case AFS_4G:
          aRes = 4.0/32768.0;
          break;
    case AFS_8G:
          aRes = 8.0/32768.0;
          break;
    case AFS_16G:
          aRes = 16.0/32768.0;
          break;
  }
}

/**
 * @brief Read accelerometer data
 * @param destination pointer to receiver buffer
 */
void MPU9250_ReadAccelData(int16_t * destination)
{
  uint8_t rawData[6];  // x/y/z accel register data stored here

