ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template_v2/Drivers/BSP/Src/stm32f4_i2c_mpu9250.c
  I2C_ReadBytes(MPU9250_I2C_ADDRESS,ACCEL_XOUT_H,rawData,6); // Read the six raw data registers sequentially into data array

  destination[0] = (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]);  // Turn the MSB and LSB into a signed 16-bit value
  destination[1] = (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]);
  destination[2] = (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]);
}

/**
 * @brief Read Gyrometer data
 * @param destination pointer to receiver buffer
 */
void MPU9250_ReadGyroData(int16_t * destination)
{
  uint8_t rawData[6];  // x/y/z gyro register data stored here

  I2C_ReadBytes(MPU9250_I2C_ADDRESS,GYRO_XOUT_H,rawData, 6);  // Read the six raw data registers sequentially into data array

  destination[0] = (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]) ;  // Turn the MSB and LSB into a signed 16-bit value
  destination[1] = (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]) ;
  destination[2] = (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]) ;
}

/**
 * @brief Read magnetometer data
 * @param destination pointer to receiver buffer
 */
void MPU9250_ReadMagData(int16_t * destination)
{
  uint8_t rawData[7];  // x/y/z gyro register data, ST2 register stored here, must read ST2 at end of data acquisition
  if(I2C_ReadRegister(AK8963_ADDRESS, AK8963_ST1) & 0x01)
  { // wait for magnetometer data ready bit to be set
    I2C_ReadBytes(AK8963_ADDRESS, AK8963_XOUT_L,rawData,7);  // Read the six raw data and ST2 registers sequentially into data array
    uint8_t c = rawData[6]; // End data read by reading ST2 register
    if(!(c & 0x08))
    { // Check if magnetic sensor overflow set, if not then report data
      destination[0] = (int16_t)(((int16_t)rawData[1] << 8) | rawData[0]);  // Turn the MSB and LSB into a signed 16-bit value
      destination[1] = (int16_t)(((int16_t)rawData[3] << 8) | rawData[2]);  // Data stored as little Endian
      destination[2] = (int16_t)(((int16_t)rawData[5] << 8) | rawData[4]);
    }
  }
}


/**
 * @brief Reset the device
 */
void MPU9250_ResetMPU9250(void)
{
  // reset device
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, PWR_MGMT_1, 0x80); // Write a one to bit 7 reset bit; toggle reset device
  HAL_Delay(100);
}

/**
 * @brief Initialize magnetometer
 * @param destination pointer to the calibration buffer
 */
void AK8963_Init(float * destination)
{
  uint8_t whoami;
  // First extract the factory calibration for each magnetometer axis
  uint8_t rawData[3];  // x/y/z gyro calibration data stored here
  whoami = I2C_ReadRegister(AK8963_ADDRESS,WHO_AM_I_AK8963);
  if(whoami != 0x48)
  {
    uprintf(&huart4,"Error! unable to connect AK8963\r\n");
    while(1);
  }
  I2C_WriteRegister(AK8963_ADDRESS, AK8963_CNTL, 0x00); // Power down magnetometer
  HAL_Delay(50);
  I2C_WriteRegister(AK8963_ADDRESS, AK8963_CNTL, 0x0F); // Enter Fuse ROM access mode
  HAL_Delay(50);
  I2C_ReadBytes(AK8963_ADDRESS, AK8963_ASAX,rawData,3);  // Read the x-, y-, and z-axis calibration values
//  rawData[0] = I2C_ReadRegister(AK8963_ADDRESS,AK8963_ASAX);
//  rawData[1] = I2C_ReadRegister(AK8963_ADDRESS,AK8963_ASAY);
//  rawData[2] = I2C_ReadRegister(AK8963_ADDRESS,AK8963_ASAZ);
  destination[0] =  (float)(rawData[0] - 128)/256 + 1;   // Return x-axis sensitivity adjustment values, etc.
  destination[1] =  (float)(rawData[1] - 128)/256 + 1;
  destination[2] =  (float)(rawData[2] - 128)/256 + 1;
  I2C_WriteRegister(AK8963_ADDRESS, AK8963_CNTL, 0x00); // Power down magnetometer
  HAL_Delay(10);
  // Configure the magnetometer for continuous read and highest resolution
  // set Mscale bit 4 to 1 (0) to enable 16 (14) bit resolution in CNTL register,
  // and enable continuous mode data acquisition Mmode (bits [3:0]), 0010 for 8 Hz and 0110 for 100 Hz sample rates
  I2C_WriteRegister(AK8963_ADDRESS, AK8963_CNTL, Mscale << 4 | Mmode); // Set magnetometer data resolution and sample ODR
  HAL_Delay(10);
}

/**
 * @brief initialize accelerometer and gyrometer
 */
void MPU9250_Init(void)
{
 // Initialize MPU9250 device
 // wake up device
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, PWR_MGMT_1, 0x00); // Clear sleep mode bit (6), enable all sensors
  HAL_Delay(100); // Delay 100 ms for PLL to get established on x-axis gyro; should check for PLL ready interrupt

 // get stable time source
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, PWR_MGMT_1, 0x01);  // Set clock source to be PLL with x-axis gyroscope reference, bits 2:0 = 001

 // Configure Gyro and Accelerometer
 // Disable FSYNC and set accelerometer and gyro bandwidth to 44 and 42 Hz, respectively;
 // DLPF_CFG = bits 2:0 = 010; this sets the sample rate at 1 kHz for both
 // Maximum delay is 4.9 ms which is just over a 200 Hz maximum rate
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, CONFIG, 0x03);

 // Set sample rate = gyroscope output rate/(1 + SMPLRT_DIV)
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, SMPLRT_DIV, 0x04);  // Use a 200 Hz rate; the same rate set in CONFIG above

 // Set gyroscope full scale range
 // Range selects FS_SEL and AFS_SEL are 0 - 3, so 2-bit values are left-shifted into positions 4:3
  uint8_t c =  I2C_ReadRegister(MPU9250_I2C_ADDRESS, GYRO_CONFIG);
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, GYRO_CONFIG, c & ~0xE0); // Clear self-test bits [7:5]
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, GYRO_CONFIG, c & ~0x18); // Clear AFS bits [4:3]
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, GYRO_CONFIG, c | Gscale << 3); // Set full scale range for the gyro

 // Set accelerometer configuration
  c =  I2C_ReadRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG);
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG, c & ~0xE0); // Clear self-test bits [7:5]
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG, c & ~0x18); // Clear AFS bits [4:3]
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG, c | Ascale << 3); // Set full scale range for the accelerometer

 // Set accelerometer sample rate configuration
 // It is possible to get a 4 kHz sample rate from the accelerometer by choosing 1 for
 // accel_fchoice_b bit [3]; in this case the bandwidth is 1.13 kHz
  c = I2C_ReadRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG2);
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG2, c & ~0x0F); // Clear accel_fchoice_b (bit 3) and A_DLPFG (bits [2:0])
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG2, c | 0x03); // Set accelerometer rate to 1 kHz and bandwidth to 41 Hz

