ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template_v2/Drivers/BSP/Src/stm32f4_i2c_mpu9250.c
  for ( ii=0; ii < 3; ii++)
  { // Get average of 200 values and store as average self-test readings
  aSTAvg[ii] /= 200;
  gSTAvg[ii] /= 200;
  }

 // Configure the gyro and accelerometer for normal operation
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, ACCEL_CONFIG, 0x00);
  I2C_WriteRegister(MPU9250_I2C_ADDRESS, GYRO_CONFIG, 0x00);
  HAL_Delay(25); // Delay a while to let the device stabilize

   // Retrieve accelerometer and gyro factory Self-Test Code from USR_Reg
   selfTest[0] = I2C_ReadRegister(MPU9250_I2C_ADDRESS, SELF_TEST_X_ACCEL); // X-axis accel self-test results
   selfTest[1] = I2C_ReadRegister(MPU9250_I2C_ADDRESS, SELF_TEST_Y_ACCEL); // Y-axis accel self-test results
   selfTest[2] = I2C_ReadRegister(MPU9250_I2C_ADDRESS, SELF_TEST_Z_ACCEL); // Z-axis accel self-test results
   selfTest[3] = I2C_ReadRegister(MPU9250_I2C_ADDRESS, SELF_TEST_X_GYRO); // X-axis gyro self-test results
   selfTest[4] = I2C_ReadRegister(MPU9250_I2C_ADDRESS, SELF_TEST_Y_GYRO); // Y-axis gyro self-test results
   selfTest[5] = I2C_ReadRegister(MPU9250_I2C_ADDRESS, SELF_TEST_Z_GYRO); // Z-axis gyro self-test results

  // Retrieve factory self-test value from self-test code reads
   factoryTrim[0] = (float)(2620/1<<FS)*(power( 1.01 , ((float)selfTest[0] - 1.0) )); // FT[Xa] factory trim calculation
   factoryTrim[1] = (float)(2620/1<<FS)*(power( 1.01 , ((float)selfTest[1] - 1.0) )); // FT[Ya] factory trim calculation
   factoryTrim[2] = (float)(2620/1<<FS)*(power( 1.01 , ((float)selfTest[2] - 1.0) )); // FT[Za] factory trim calculation
   factoryTrim[3] = (float)(2620/1<<FS)*(power( 1.01 , ((float)selfTest[3] - 1.0) )); // FT[Xg] factory trim calculation
   factoryTrim[4] = (float)(2620/1<<FS)*(power( 1.01 , ((float)selfTest[4] - 1.0) )); // FT[Yg] factory trim calculation
   factoryTrim[5] = (float)(2620/1<<FS)*(power( 1.01 , ((float)selfTest[5] - 1.0) )); // FT[Zg] factory trim calculation

 // Report results as a ratio of (STR - FT)/FT; the change from Factory Trim of the Self-Test Response
 // To get percent, must multiply by 100
   for (i = 0; i < 3; i++)
   {
     destination[i] = 100.0*((float)(aSTAvg[i] - aAvg[i]))/factoryTrim[i]; // Report percent differences
     destination[i+3] = 100.0*((float)(gSTAvg[i] - gAvg[i]))/factoryTrim[i+3]; // Report percent differences
   }

}

void FloatToDecimal(float input, int16_t *buffer)
{
  float temp;
  int16_t temp1,temp2;

  temp1 = (int)input;
  temp = input - temp1;
  temp = temp * 10000;
  temp2 =((int)(temp)%10000);
  if(temp2<0)
  {
    temp2 = temp2 * (-1);
  }
  buffer[0] = temp1;
  buffer[1] = temp2;
}


void MPU9250_GetData(void)
{
  int16_t output[2]={0};

    if (MPU9250_INT_PinStatus() & 0x01) // On interrupt, check if data ready interrupt
     {
      MPU9250_ReadAccelData(accelCount);  // Read the x/y/z adc values
      // Now we'll calculate the accleration value into actual g's
      ax = (float) accelCount[0] * aRes - accelBias[0]; // get actual g value, this depends on scale being set
      ay = (float) accelCount[1] * aRes - accelBias[1];
      az = (float) accelCount[2] * aRes - accelBias[2];

      MPU9250_ReadGyroData(gyroCount);  // Read the x/y/z adc values
      // Calculate the gyro value into actual degrees per second
      gx = (float) gyroCount[0] * gRes - gyroBias[0]; // get actual gyro value, this depends on scale being set
      gy = (float) gyroCount[1] * gRes - gyroBias[1];
      gz = (float) gyroCount[2] * gRes - gyroBias[2];

      MPU9250_ReadMagData(magCount);  // Read the x/y/z adc values
      // Calculate the magnetometer values in milliGauss
      // Include factory calibration per data sheet and user environmental corrections
      mx = (float) magCount[0] * mRes * magCalibration[0] - magbias[0]; // get actual magnetometer value, this depends on scale being set
      my = (float) magCount[1] * mRes * magCalibration[1] - magbias[1];
      mz = (float) magCount[2] * mRes * magCalibration[2] - magbias[2];
     }
     ax = ax * 1000;
     ay = ay * 1000;
     az = az * 1000;

     FloatToDecimal(ax,output);
     uprintf(&huart4, "\x1b[3;1Hax = %d03.%d04", output[0], output[1]);

     FloatToDecimal(ay, output);
     uprintf(&huart4, " ay = %d03.%d04",output[0], output[1]);

     FloatToDecimal(az, output);
     uprintf(&huart4, " az = %d04.%d04 mg\r\n", output[0],output[1]);


     FloatToDecimal(gx,output);
     uprintf(&huart4, "\x1b[4;1Hgx = %d03.%d04",output[0], output[1]);

     FloatToDecimal(gy, output);
     uprintf(&huart4, " gy = %d03.%d04", output[0], output[1]);

     FloatToDecimal(gz, output);
     uprintf(&huart4, " gz = %d03.%d04 deg/s\r\n", output[0], output[1]);


     FloatToDecimal(mx, output);
     uprintf(&huart4, "\x1b[5;1Hmx = %d03.%d04", output[0], output[1]);

     FloatToDecimal(my, output);
     uprintf(&huart4, " my = %d03.%d04", output[0], output[1]);

     FloatToDecimal(mz, output);
     uprintf(&huart4, " mz = %d03.%d04 mG\r\n", output[0], output[1]);

}

/*
// Implementation of Sebastian Madgwick's "...efficient orientation filter for... inertial/magnetic sensor arrays"
// (see http://www.x-io.co.uk/category/open-source/ for examples and more details)
// which fuses acceleration, rotation rate, and magnetic moments to produce a quaternion-based estimate of absolute
// device orientation -- which can be converted to yaw, pitch, and roll. Useful for stabilizing quadcopters, etc.
// The performance of the orientation filter is at least as good as conventional Kalman-based filtering algorithms
// but is much less computationally intensive---it can be performed on a 3.3 V Pro Mini operating at 8 MHz!

void MPU9250_MadgwickQuaternionUpdate(float ax, float ay, float az, float gx, float gy, float gz, float mx, float my, float mz)
{
  float GyroMeasError = PI * (60.0f / 180.0f);     // gyroscope measurement error in rads/s (start at 60 deg/s), then reduce after ~10 s to 3
  float beta = sqrt(3.0f / 4.0f) * GyroMeasError;  // compute beta
  float GyroMeasDrift = PI * (1.0f / 180.0f);      // gyroscope measurement drift in rad/s/s (start at 0.0 deg/s/s)
  float zeta = sqrt(3.0f / 4.0f) * GyroMeasDrift;  // compute zeta, the other free parameter in the Madgwick scheme usually set to a small or zero value
  q[0] = 1.0f;
  q[1] = 0.0f;
  q[2] = 0.0f;
  q[3] = 0.0f;
  float q1 = q[0], q2 = q[1], q3 = q[2], q4 = q[3];   // short name local variable for readability
  float norm;
  float hx, hy, _2bx, _2bz;
  float s1, s2, s3, s4;
  float qDot1, qDot2, qDot3, qDot4;

  // Auxiliary variables to avoid repeated arithmetic
  float _2q1mx;
  float _2q1my;
  float _2q1mz;
  float _2q2mx;
  float _4bx;
  float _4bz;
  float _2q1 = 2.0f * q1;
  float _2q2 = 2.0f * q2;
  float _2q3 = 2.0f * q3;
  float _2q4 = 2.0f * q4;
  float _2q1q3 = 2.0f * q1 * q3;
  float _2q3q4 = 2.0f * q3 * q4;
  float q1q1 = q1 * q1;
  float q1q2 = q1 * q2;
  float q1q3 = q1 * q3;
  float q1q4 = q1 * q4;
  float q2q2 = q2 * q2;
  float q2q3 = q2 * q3;
  float q2q4 = q2 * q4;
  float q3q3 = q3 * q3;
  float q3q4 = q3 * q4;
  float q4q4 = q4 * q4;

  // Normalise accelerometer measurement
  norm = sqrt(ax * ax + ay * ay + az * az);
  if (norm == 0.0f) return; // handle NaN
  norm = 1.0f/norm;
  ax *= norm;
  ay *= norm;
  az *= norm;

  // Normalise magnetometer measurement
  norm = sqrt(mx * mx + my * my + mz * mz);
  if (norm == 0.0f) return; // handle NaN
  norm = 1.0f/norm;
  mx *= norm;
  my *= norm;
  mz *= norm;

